<?php

/**
 * 冒泡排序
 *
 * ------------------------------------------------------------
 * 比较相邻两个数据，如果后一个数较小，就交换位置 
 * ------------------------------------------------------------
 *
 * 分类 ------------------- 内排序
 * 最差时间复杂度 ---------- o(n^2)
 * 最优时间复杂度 ---------- o(n) 增加flag标志位，如果一轮比较没有发生交换，则结束排序
 * 平均时间复杂度 ---------- o(n^2)
 * 所需空间复杂度 ---------- o(1)
 * 稳定 ------------------- 稳定         
 */

/**
 * BubbleSort
 * 
 * @param array $arr
 * @return array
 */
function bubbleSort(array $arr)
{
	$size = count($arr) - 1;
	for ($i = 0; $i < $size; $i++) {
		for ($j = 0; $j < $size - $i; $j++) {
			if ($arr[$j] > $arr[$j + 1]) {
				$tmp         = $arr[$j];
				$arr[$j]     = $arr[$j + 1];
				$arr[$j + 1] = $tmp;
			}
		}
	}
	return $arr;
}

// +---------------------------------
// | 测试方案
// +---------------------------------
$arr = [11,18,14,52,43,88,9,49,42,96];

var_export(bubbleSort($arr));

// +---------------------------------
// | 测试结果
// +---------------------------------

/*
array (
 0 => 9,
 1 => 11,
 2 => 14,
 3 => 18,
 4 => 42,
 5 => 43,
 6 => 49,
 7 => 52,
 8 => 88,
 9 => 96,
)
*/